requests/updateUserRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://backend.com/soap/web/users">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:updateUserRequest>
            <gs:userTO>
                <gs:name>Alex</gs:name>
                <gs:login>alex</gs:login>
                <gs:password>Alex99</gs:password>
                <gs:role>Admin</gs:role>
                <gs:role>Engineer</gs:role>
                <gs:role>Analytic</gs:role>
            </gs:userTO>
        </gs:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>